//====================================================
//
// メイン処理 [main.h]
//
//====================================================
#ifndef ___MAIN_H___
#define ___MAIN_H___

#define USE_SOUND

//****************************************************
// インクルード部
//****************************************************
#include <Windows.h>
#include "d3dx9.h"			// 描画処理に必要

#include "xaudio2.h"

//****************************************************
// ライブラリのリンク
//****************************************************
#if 1 // [ここを"0"にした場合、"構成プロパティ" -> "リンカ" -> "入力" -> "追加の依存ファイル"に対象ライブラリを設定する]
#pragma comment (lib, "d3d9.lib")		//描画処理に必要
#pragma comment (lib, "d3dx9.lib")		//[d3d9.lib]の拡張ライブラリ
#pragma comment (lib, "dxguid.lib")		//DirectXコンポーネント
#pragma comment (lib, "winmm.lib")		//時刻計測用にマルチメディアタイマー
#endif

//****************************************************
// マクロ・定数定義
//****************************************************
#define SCREEN_WIDTH	(631 * 0.8)		// ウインドウの幅
#define SCREEN_HEIGHT	(792 * 0.8)		// ウインドウの高さ

#define SCREEN_CENTER_X (SCREEN_WIDTH / 2)	// ウインドウの中心X座標
#define SCREEN_CENTER_Y (SCREEN_HEIGHT / 2)	// ウインドウの中心Y座標

#define NUM_VERTEX		(4)			// 頂点数
#define	NUM_POLYGON		(2)			// ポリゴン数

#define FVF_VERTEX_2D	(D3DFVF_XYZRHW | D3DFVF_DIFFUSE | D3DFVF_TEX1)	// 頂点フォーマット(画面上座標 | 頂点カラー | テクスチャ座標)

// 上記の頂点情報フォーマットに合わせた構造体を定義
typedef struct
{
	D3DXVECTOR3 pos;	// 頂点座標
	float		rhw;	// テクスチャのパースペクティブコレクト
	D3DCOLOR	col;	// 頂点カラー
	D3DXVECTOR2 tex;	// テクスチャ座標
}VERTEX_2D;

//****************************************************
// 構造体定義
//****************************************************

//****************************************************
// 列挙型
//****************************************************
typedef enum
{
	MODE_TITLE,			//0:タイトル
	MODE_PLAY,			//1:ゲームプレイ
	MODE_DIRECTION,		//2:演出
	MODE_BIG,			//3:ビック演出
	MODE_PAUSE,			//4:ポーズ
	MODE_RESULT,		//5:リザルト
	MODE_MAX
} MODE;

//****************************************************
// プロトタイプ宣言
//****************************************************
LPDIRECT3DDEVICE9 GetDevice(void);
void SetMode(MODE);
MODE GetMode(void);

//****************************************************
// グローバル変数
//****************************************************
#endif